app/controllers/storagefiles_controller.rb

  def new
    @user = User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)

  def uploadFile
    @user = User.find(params[:user_id])
    name =  params[:upload]['datafile'].original_filename
    file_ext = File.extname(name)         #=> ".rb"
    arr_types = Array['.doc','.docx','.docm','.dot','.dotx','.dotm','.rtf','.ppt','.pot','.pps']
    if (arr_types.include?(file_ext))
      begin
        directory = "./public/data"
        fpath = File.join(directory, name)
        ftype = params[:upload]['datafile'].content_type
        fsize = params[:upload]['datafile'].size
        c = @user.storagefiles.find_by_name(name)
        c.update_attributes(:name =>name,:path =>fpath,:files_type =>ftype,:size =>fsize,:access =>'private')
      rescue #RecordNotFound
        @user.storagefiles << Storagefile.new(:name=>name, :path=>fpath,:files_type=>ftype,:size=>fsize, :access=>'private')
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `storagefiles` WHERE (`storagefiles`.`name` = 'Названы самые грязные города Украины.doc') AND (`storagefiles`.user_id = 1) LIMIT 1
UPDATE `storagefiles` SET `updated_at` = '2011-05-24 14:45:48', `size` = 26624 WHERE `id` = 56
INSERT INTO `storagefiles` (`name`, `size`, `created_at`, `files_type`, `updated_at`, `user_id`, `path`, `access`) VALUES('list_dpau.pdf', 123896, '2011-05-16 07:20:15', 'application/pdf', '2011-05-16 07:20:15', NULL, './public/data/list_dpau.pdf', 'private')

  def index
    @user = User.find(params[:user_id])
    case params[:ffield]
    when 'files_type','size','name'
      @sfiles = @user.storagefiles.find(:all, :order => "#{params[:ffield]} #{params[:order]}")
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `storagefiles` WHERE (`storagefiles`.`user_id` = 1) ORDER BY id asc

  def show_all
    @user = User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def show_public
    @user = User.find(params[:user_id])
    pub = 'public'
    case params[:ffield]
    when 'files_type','size','name'
      @sfiles = Storagefile.find(:all, :conditions =>["access = ? AND user_id <> ?", pub, params[:user_id]], :order => "#{params[:ffield]} #{params[:order]}")
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `storagefiles` WHERE (access = 'public' AND user_id <> 'current_usr') ORDER BY user_id asc

  def apply
    if request.post?
      @user = User.find(params[:user_id])
      access_ids = params[:access_id].collect {|id| id.to_i} if params[:access_id]
      delete_ids = params[:deleteFiles].collect {|id| id.to_i} if params[:deleteFiles]
      if access_ids
        flash[:notice] = "Files successfully updated"
        access_ids.each do |id|
          r = @user.storagefiles.find(id)
          if r.access == "public"
            r.access = "private"
          else
            r.access = "public"
          end
          r.save
        end
      end
      if delete_ids
        flash[:notice] = "Files successfully deleted"
        Storagefile.destroy(delete_ids)
---
SELECT * FROM `users` WHERE (`users`.`id` = 2)
SELECT * FROM `storagefiles` WHERE (`storagefiles`.`user_id` = '2' AND `storagefiles`.`id` = 5) LIMIT 1
UPDATE `storagefiles` SET `updated_at` = '2011-05-16 10:01:18', `access` = 'public' WHERE `id` = 5
DELETE FROM `storagefiles` WHERE `id` = 7