app/controllers/storagefiles_controller.rb

SELECT * FROM `storagefiles` WHERE (`storagefiles`.`user_id` = '3') ORDER BY files_type desc
---
  def show
    case params[:ffield]
    when 'files_type','size','name'
      @sfiles = Storagefile.find_all_by_user_id(session[:id], :order => "#{params[:ffield]} #{params[:order]}")