app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `created_at`, `avatar_file_name`, `avatar_file_size`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `avatar_content_type`, `remember_token`, `login`, `avatar_updated_at`, `email`) VALUES('', '9db2db47af61814766d7e1db663397c4b9b35838', '2011-05-09 12:36:05', NULL, NULL, 'd6d9a7d78f392e6b6cd4c7d413ff0240b8012246', NULL, '2011-05-09 12:36:05', NULL, NULL, 'vlad', NULL, 'vmetw@ukr.net')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])

    success = @user && @user.save